pages/Lesson_2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>It all adds up</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="css/styles.css"/>
<link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">It all adds up</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a>
<ul>
<li><a href="#sec-1-1">Code It</a></li>
<li><a href="#sec-1-2">Badge It</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class=ribbon>
<a href="https://github.com/stsb11/9-CS-euler">Fork me on GitHub</a>
</div>

<div id="outline-container-sec-1" class="outline-2 activity">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-1" class="outline-3 test">
<h3 id="sec-1-1">Code It</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Computers make excellent calculators. This program will show any times table you want.
</li>
<li>You're going to play around with the code below a bit.
</li>
<li>Remember that if you break the program, you can always refresh the browser page and pick up a new version; there's no risk of breaking anything.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3 try">
<h3 id="sec-1-2">Badge It</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li><b>Silver:</b> Fizz-buzz is a maths game.
<ul class="org-ul">
<li>Players take it in turns to count up from 1. 
</li>
<li>If the number they're about to say is divisible by 3, they say 'Fizz' instead of their number.
</li>
<li>If the number is divisible by 5, they say 'Buzz'.
</li>
<li>If its divisible by both 3 and 5, the player says 'FizzBuzz'.
</li>
<li>Otherwise, the player says their number. 
</li>
</ul>
</li>
<li>The first few moves are 1, 2, fizz, 4, buzz, fizz&#x2026;
</li>
</ul>
<iframe src="https://trinket.io/embed/python/19f3002d2e" width="100%" height="500" frameborder="0" marginwidth="0" marginheight="0" allowfullscreen></iframe>
<ul class="org-ul">
<li>The program above prints out the output of a game of FizzBuzz.
</li>
<li>Sometimes we want to do division and be able to calculate remainders
</li>
<li>The computer science term for this is <i>modulo</i>, and in Python this is represented with a % sign. 
</li>
<li>E.g. Performing <code>15 % 5</code> would give <code>0</code>. There is no remainder when you do 15 divided by 5.
</li>
<li>Doing <code>7 % 6</code> would give a remainder of <code>1</code>.
</li>
<li>To collect the badge, modify this program to also allow a number that is a multiple of 7 to include the output 'Pop', and a multiple of 11 outputs 'Whack' (as well as fizz/buzz).
</li>
</ul>


<ul class="org-ul">
<li><b>Gold:</b> This task is a bit like an English comprehension task. To collect this badge, answer the following questions:
<ol class="org-ol">
<li>What is the <code>while</code> loop doing in lines 4 and 5? The program will work without it, if you unindent the line underneath it.
</li>
<li>The <code>for</code> line makes the <code>multiplier</code> variable increase by one each time the loop repeats. 
<ul class="org-ul">
<li>What needs to change to make the program start at 2x or 3x instead of 1x?
</li>
<li>What needs to change to make the program go up to 100x instead of 12x?
</li>
</ul>
</li>
<li>What happens if the <code>print(nextAnswer)</code> line isn't indented? Why?
</li>
</ol>
</li>
</ul>
<iframe src="https://trinket.io/embed/python/2b640d363a" width="100%" height="400" frameborder="0" marginwidth="0" marginheight="0" allowfullscreen></iframe>
<ul class="org-ul">
<li>Write your answers in a text file using Notepad, and upload them.
</li>
</ul>


<ul class="org-ul">
<li><b>Platinum:</b> Write a program to add up all the numbers from 1 to any number the user enters.
</li>
<li>You can either use the template below, or write your answer in IDLE. 
</li>
</ul>
<iframe src="https://trinket.io/embed/python/edd1c017f4" width="100%" height="600" frameborder="0" marginwidth="0" marginheight="0" allowfullscreen></iframe>
<ul class="org-ul">
<li>Screenshot and upload your code to collect the badge. 
</li>
<li>Extra credit if you give the user the option to multiply all the numbers together or add them up.
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
